[{"id":"2","title":"Shavkat Mirziyoyev speaks about Uzbekistan’s position in foreign policy","pubDate":"2023-03-13","shortContent":"In Termiz, a session of the people’s deputies council of Surkhandarya region is taking place with the participation of Shavkat Mirziyoyev.","imgUrl":"https://storage.kun.uz/source/9/GvH-1QtQVfsxTpBSL91_wdG0_iwMRmE6.jpg","topicId":"1","fullContent":"During the session, the head of state touched on some foreign policy situations, Uzbekistan’s position.\n\n“You should know: times are very complicated. Now big countries are saying: “Is Uzbekistan on the side of someone? It’s enough now, it is high time to define your position”. Their representatives are coming and urging us to do so. “We need Uzbekistan in Central Asia, its population is 36 million, it will be 40 million in 3-4 years, it will become a big country, are you on the side of someone?” they say. How to answer such a difficult question? There is only one answer: I am ready to die for the sake of my nation, my people, my great Uzbekistan,” Shavkat Mirziyoyev said.\n\nFor information, on February 28, US Secretary of State Antony Blinken visited the capital of Uzbekistan, Tashkent, for the first time. Acting Minister of Foreign Affairs of Uzbekistan, Bakhtiyor Saidov said that the meeting was “very effective” and expressed gratitude to Washington for its constant support of the reform program initiated by the government of Uzbekistan.\n\nAfter that, Russian Foreign Minister Sergey Lavrov said that the purpose of US Secretary of State Antony Blinken’s visit to the countries of Central Asia is to destroy the good neighborly relations of these countries with Russia.\n\n“The United States do not hide it. They are working to prevent these countries from maintaining good relations with Russia,” Lavrov said. According to him, representatives of the USA, EU and Great Britain have increased their activeness in the CIS countries.","watched":78,"likes":71},{"id":"zz69aolfp7z3i3","title":"Uzbekistan increases EV imports","pubDate":"2023-03-21","shortContent":"In January-February 2023, Uzbekistan imported 786 electric cars worth $26.8 million from 8 foreign countries.","imgUrl":"https://storage.kun.uz/source/9/oT1B6Lu-L6Q0PPLRJP0BSbC-HDTeJea9.jpg","topicId":"3","fullContent":"According to the Statistics Agency, the import of electric cars increased by 562 compared to the same period last year.\r\n\r\nDuring the reporting period, Uzbekistan imported EVs mainly from China (705).\r\n\r\nOther suppliers of electric vehicles to the market of Uzbekistan:\r\n\r\nHong Kong - 56\r\nGermany - 15\r\nUAE - 5\r\nSouth Korea - 2\r\n\r\nEarlier, the Statistics Agency provided information on the production of passenger cars in Uzbekistan over the past two months.\r\n\r\nThe agency noted that in January-February 2023, Damas was the most produced model in the country - 9,436 units.\r\n\r\nFigures for other car models: \r\n\r\nCobalt - 7,673 \r\nLacetti-Gentra - 5,174 \r\nTracker - 1,087 \r\nNexia T-250 - 467\r\nOnix - 112\r\nspecial passenger cars - 3,755","watched":1,"likes":0},{"id":"zz69aolfp819gk","title":"UzAS clarifies whether Uzbek scientists created a drug that cures 99% of cancer","pubDate":"2023-03-23","shortContent":"Information that Uzbek scientists have developed a drug that cures 99% of cancer has been misinterpreted. The drug is designed to treat only one type of cancer with high efficiency.","imgUrl":"https://storage.kun.uz/source/9/oNIvbdNcixU4gh7kujPq-PXj9IBus62d.jpg","topicId":"2","fullContent":"After an interview was published in UzA that Uzbek scientists have developed a new drug that can cure up to 99% of cancer, there were public objections to it. According to the Academy of Sciences of Uzbekistan (UzAS), the Lutetium-177 PSMA-617 radiopharmaceutical mentioned in the interview is effective in the treatment of only one type of cancer, that is, prostate cancer, which occurs mainly in older men. At the same time, in the 4th and 5th doses, a therapeutic effect on metastases in other parts of the body was observed. The information service of the academy commented that the interview was reprinted by other sites in an extremely shortened form, so the information about PSMA was omitted.\n\n“Thus, the public believed that this drug cures all cancers,” UzAS said in a statement.\n\nAlso, UzAS asked media representatives to pay special attention to the source of news and information, and the correctness of given facts.","watched":3,"likes":0}]