[{"id":"2","title":"Shavkat Mirziyoyev speaks about Uzbekistan’s position in foreign policy","pubDate":"2023-03-13","shortContent":"In Termiz, a session of the people’s deputies council of Surkhandarya region is taking place with the participation of Shavkat Mirziyoyev.","imgUrl":"https://storage.kun.uz/source/9/GvH-1QtQVfsxTpBSL91_wdG0_iwMRmE6.jpg","topicId":"1","fullContent":"During the session, the head of state touched on some foreign policy situations, Uzbekistan’s position.\n\n“You should know: times are very complicated. Now big countries are saying: “Is Uzbekistan on the side of someone? It’s enough now, it is high time to define your position”. Their representatives are coming and urging us to do so. “We need Uzbekistan in Central Asia, its population is 36 million, it will be 40 million in 3-4 years, it will become a big country, are you on the side of someone?” they say. How to answer such a difficult question? There is only one answer: I am ready to die for the sake of my nation, my people, my great Uzbekistan,” Shavkat Mirziyoyev said.\n\nFor information, on February 28, US Secretary of State Antony Blinken visited the capital of Uzbekistan, Tashkent, for the first time. Acting Minister of Foreign Affairs of Uzbekistan, Bakhtiyor Saidov said that the meeting was “very effective” and expressed gratitude to Washington for its constant support of the reform program initiated by the government of Uzbekistan.\n\nAfter that, Russian Foreign Minister Sergey Lavrov said that the purpose of US Secretary of State Antony Blinken’s visit to the countries of Central Asia is to destroy the good neighborly relations of these countries with Russia.\n\n“The United States do not hide it. They are working to prevent these countries from maintaining good relations with Russia,” Lavrov said. According to him, representatives of the USA, EU and Great Britain have increased their activeness in the CIS countries.","watched":78,"likes":71},{"id":"zz62c8lfqnxnl9","title":"ASC","pubDate":"2023-03-09","shortContent":"qwqdq","imgUrl":"https://storage.kun.uz/source/9/GvH-1QtQVfsxTpBSL91_wdG0_iwMRmE6.jpg","topicId":"3","fullContent":"acs","watched":0,"likes":0}]